Tekla.Structures.Model.Collaboration.IFC2X3_ParametricObject_IShapeProfile
The IFC2X3_ParametricObject_IShapeProfile class contains the I-shape profile definition.

Tekla.Structures.Model.Collaboration.IFC2X3_ParametricObject_IShapeProfile.OverallWidth
The overall width.

Tekla.Structures.Model.Collaboration.IFC2X3_ParametricObject_IShapeProfile.OverallDepth
The overall depth.

Tekla.Structures.Model.Collaboration.IFC2X3_ParametricObject_IShapeProfile.WebThickness
The web thickness.

Tekla.Structures.Model.Collaboration.IFC2X3_ParametricObject_IShapeProfile.FlangeThickness
The flange thickness.

Tekla.Structures.Model.Collaboration.IFC2X3_ParametricObject_IShapeProfile.FilletRadius
The fillet radius.